index.html
<!doctype html>
<html lang="en">
<head>
<title>unix ramblings</title>
<!-- 2018-03-13 Tue 21:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="nnungest">
<link rel="stylesheet" type="text/css" href="stylesheet.css" />
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">unix ramblings</h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">First Post</h2>
<div class="outline-text-2" id="text-">
<p>
2018-03-13 Tue
</p>

<p>
First post. I think I'm supposed to "Hello World" or something.. Grammar here will be terrible, there will be run-on sentences and awful spelling of almost every other word. Most posts will be about frustrating or cool things I run into while working. Stay tuned or cringe and look away..  
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">getting the job done</h2>
<div class="outline-text-2" id="text-">
<p>
2018-03-13 Tue
</p>

<p>
I just wanted to take some time to go ahead and lay out my preferred setup. Unfortunately at work I have no choice on OS and must use OSX. To make this list short and get to the point, lets suppose a scenario: I have to pick my OS and software and cannot change that for 2 years and I only had a day to set things up. What follows is probably close to what I would be running.
</p>

<ul class="org-ul">
<li>OS: Linux
</li>
<li>Distro: Manjaro
</li>
<li>WM: i3 (via Manjaro i3 Community Edition)
</li>
<li>Text Editors: Vim (via spf13vim), Emacs (via Spacemacs)
</li>
<li>Utils: Qutebrowser, Weechat, Pywall, HTTPie, MPV, MPD, NCMPCPP, Chrome (sadly), maybe Docker if I had some images already pulled, Virtualbox (with some spare isos), udiskie, Taskwarrior, The Gimp and the Libreoffice suite. 
</li>
<li>Languages: Python, Lua, GO, Ruby, Awk, Perl, Bash and Node
</li>
<li>Gaming: I could probably just get by on some free games, or have a few offline via Steam (not a huge gamer). 
</li>
</ul>

<p>
Most of the utilities that I need are already either included in the i3 community edition of Manjaro so I wont mention every single one. 
</p>

<p>
Why not go with just vanilla Vim or Emacs? Well for the simple fact that if I dont like the config I can just backup the fancy and use a basic config for either.
</p>

<p>
That pretty much lays out what I like or don't like. I'm sure I missed at least a few thing from the list but you get the picture.
</p>








<hr >
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">First Post</a></li>
<li><a href="#sec-">getting the job done</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: nnungest</p>
<p class="date">Created: 2018-03-13 Tue 21:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.2)</p>
</div>
</footer>
</body>
</html>